Revit 2025 API
ConnectorDomainType Enumeration
 Type of connector domain.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ConnectorDomainType
Public Enumeration ConnectorDomainType
public enum class ConnectorDomainType
type ConnectorDomainType
Members
Member name | Value | Description
Undefined | 0 |  Domain is undefined
Hvac | 1 |  HVAC (duct) connector
Electrical | 2 |  Electrical connector
Piping | 3 |  Piping connector
CableTrayConduit | 4 |  Connector of cable trays or conduits
StructuralAnalytical | 5 |  Connector of Structural Analytical Model
See Also
Reference
Autodesk.Revit.DB Namespace